character = """
琳妮特
旅行者/水
林尼
绮良良
白术
卡维
米卡
迪希雅
艾尔海森
瑶瑶
珐露珊
流浪者
莱依拉
纳西妲
妮露
坎蒂丝
赛诺
多莉
柯莱
提纳里
旅行者/草
鹿野院平藏
久岐忍
夜兰
神里绫人
八重神子
申鹤
云堇
五郎
荒泷一斗
托马
珊瑚宫心海
埃洛伊
雷电将军
九条裟罗
早柚
宵宫
旅行者/雷
神里绫华
枫原万叶
优菈
烟绯
罗莎莉亚
胡桃
魈
甘雨
阿贝多
辛焱
钟离
达达利亚
迪奥娜
可莉
温迪
诺艾尔
旅行者/风
凯亚
莫娜
班尼特
旅行者/岩
芭芭拉
刻晴
北斗
重云
旅行者
迪卢克
七七
琴
香菱
行秋
安柏
凝光
菲谢尔
丽莎
砂糖
"""

weapon = """
裁叶萃光、圣显之钥、波乱月白经津
雾切之回光
苍古自由之誓、磐岩结绿、斫峰之刃
风鹰剑、西风之鹰的抗争、天空之刃
海渊终曲、狼牙、灰河渡手
东花坊时雨、西福斯的月光、原木刀
笼钓瓶一心、辰砂之纺锤、天目影打刀
暗巷闪光、腐殖之剑、宗室长剑
铁蜂刺、笛剑、祭礼剑、匣里龙吟
降临之剑、西风剑、黑岩长剑、黑剑
试作斩岩、旅行剑、暗铁剑
冷刃、飞天御剑、吃虎鱼刀、黎明神剑
银剑、无锋剑、苇海信标、赤角石溃杵、松籁响起之时
无工之剑、天空之傲
狼的末路、浪影阔剑、聊聊棒、饰铁之花
玛海菈的水色、森林王器、恶王丸
衔珠海皇、桂木斩长正
千岩古剑、雪葬的星银、螭骨剑
试作古华、西风大剑、钟剑、雨裁
白影剑, 黑岩斩刀, 宗室大剑, 祭礼大剑, 白铁大剑
飞天大御剑, 以理服人, 沐浴龙血的剑, 铁影阔剑
佣兵重剑, 训练大剑, 最初的大魔术, 猎人之径
若水、冬极白星、飞雷之弦振
终末嗟叹之诗、天空之翼、阿莫斯之弓
静谧之曲、烈阳之嗣、鹮穿之喙
竭泽、王下近侍、落霞
曚云之月, 掠食者, 破魔之弓
幽夜华尔兹、暗巷猎手、风花之颂、祭礼弓
苍翠猎弓, 纪行, 绝弦, 弓藏, 西风猎弓
钢轮弓、黑岩战弓、宗室长弓、试作澹月
- 离簇不归
- 反曲弓
- 神射手之誓
- 鸦羽弓
- 信使
弹弓、历练的猎弓、猎弓、碧落之珑、图莱杜拉的回忆
千夜浮梦、神乐之真意
不灭月华、尘世之锁
天空之卷、四风原典、纯水流华
遗祀玉珑、纪行、流浪的晚星、盈满之实、证誓之明瞳
白辰之环、嘟嘟可故事集、暗巷的酒与诗
忍冬之果、宗室秘法录、流浪乐章
匣里日月、纪行、西风秘典、试作金珀、祭礼残章
黑岩绯玉、昭心、万国诸海图谱、翡玉法球
甲级宝珏、魔导绪论、讨龙英杰谭、异世界行记、口袋魔导书、学徒笔记
赤沙之杖、息灾、薙草之稻光
护摩之杖、贯虹之槊、天空之脊
和璞鸢、公义的酬报、峡湾长歌
风信之锋、贯月矢、断浪长鳍
渔获、喜多院十文字、千岩长枪
龙脊长枪, 匣里灭辰, 试作星镰, 西风长枪
黑岩刺枪, 决斗之枪, 宗室猎枪, 流月针
钺矛、白缨枪、黑缨枪、铁尖枪、新手长枪
"""

artifact = """幸运儿、游医、冒险家、学士、战狂、祭冰之人、奇迹
椛染之庭、勇士之心、教官、祭火之人、赌徒、祭水之人
武人生之花
守护之心生之花
祭雷之人生之花
流放者生之花
行者之心生之花
暴击率：来歆余响
绝缘之旗印
炽烈的炎之魔女
花海甘露之光
角斗士的终幕礼、深林的记忆、追忆之注连、如雷的盛怒
冰风迷途的勇士、黄金剧团、饰金之梦、染血的骑士道
华馆梦醒形骸记、沉沦之心、逐影猎人、昔日宗室之仪
沙上楼阁史话、悠古的磐岩、海染砗磲
苍白之火、翠绿之影、乐园遗落之花、流浪大地的乐团
逆飞的流星、辰砂往生录、平息鸣雷的尊者、千岩牢固
渡过烈火的贤人、水仙之梦、被怜爱的少女"""
