character = '''
琳妮特头像.png	琳妮特	4星	单手剑	风	女	枫丹	12937	232	712	风元素伤害加成24.0%	嘲讽、快速移动、生命损耗、自身治疗、元素转化、水团探查
旅行者/水头像.png	旅行者/水	5星	单手剑	水	男/女	其它	10875	212	683	攻击力加成24%	生命损耗、自身治疗、自身伤害提升、能量恢复、护盾、治疗
林尼头像.png	林尼	5星	弓	火	男	枫丹	11021	318	538	暴击率19.2%	嘲讽、生命损耗、快速移动、自身伤害提升、自身治疗、特产探索
绮良良头像.png	绮良良	4星	单手剑	草	女	稻妻	12180	223	546	生命值加成24.0%	护盾、自身伤害提升、伤害提升、协同攻击、生物亲和、快速移动
白术头像.png	白术	5星	法器	草	男	璃月	13348	193	500	生命值加成28.8%	精通加成、治疗、护盾、协同攻击、生物交互、伤害加成
卡维头像.png	卡维	4星	双手剑	草	男	须弥	11962	234	751	元素精通96	摆设返还、特化反应、元素转化、自身治疗、自身抗打断、自身抗性提高、自身攻速提高、自身元素精通提高
米卡头像.png	米卡	4星	长柄武器	冰	男	蒙德	12506	223	713	生命值加成24.0%	伤害提升、攻速提升、治疗、能量恢复、爆伤提升、特产探索
迪希雅头像.png	迪希雅	5星	双手剑	火	女	须弥	15675	266	628	生命值加成28.8%	协同攻击、抗打断、自身治疗、移速提升、移速提升（天赋）、自身爆伤提升、能量恢复、自身倍率附加、自身暴击提升
艾尔海森头像.png	艾尔海森	5星	单手剑	草	男	须弥	13348	313	782	草元素伤害加成28.8%	元素转化、自身伤害提升、炼金返还、精通加成、冷却减少、自身暴击提升、自身爆伤提升、位移
瑶瑶头像.png	瑶瑶	4星	长柄武器	草	女	璃月	12289	212	751	生命值加成24.0%	治疗、伤害提升、生物亲和、体力回复、能量恢复、自身抗性提升
珐露珊头像.png	珐露珊	4星	弓	风	女	须弥	9570	196	628	攻击力加成24.0%	伤害提升、聚怪、能量恢复、派遣、减抗、倍率附加、技能延长、协同攻击、爆伤提升
流浪者头像.png	流浪者	5星	法器	风	男	须弥	10164	328	607	暴击率19.2%	突破返还、自身伤害提升、特殊模组、快速移动、能量恢复、自身倍率提升、自身暴击提升、自身攻速提升
莱依拉头像.png	莱依拉	4星	单手剑	冰	女	须弥	11092	217	655	生命值加成24.0%	护盾、自身伤害提升、能量恢复、炼金返还、倍率附加、自身倍率附加
纳西妲头像.png	纳西妲	5星	法器	草	女	须弥	10360	299	630	元素精通115	精通加成、自身伤害提升、减防、特化反应、技能延长、生物交互、自身暴击提升
妮露头像.png	妮露	5星	单手剑	水	女	须弥	15185	230	729	生命值加成28.8%	伤害提升、精通加成、减抗、技能延长、特化反应、烹饪、能量恢复
坎蒂丝头像.png	坎蒂丝	4星	长柄武器	水	女	须弥	10875	212	683	生命值加成24.0%	弹反、元素附魔、伤害提升、协同攻击、攀爬消耗减少、护盾
赛诺头像.png	赛诺	5星	长柄武器	雷	男	须弥	12491	318	859	暴击伤害38.4%	自身伤害提升、元素转化、感电免疫、自身抗打断、派遣、能量回复、武器幻化
多莉头像.png	多莉	4星	双手剑	雷	女	须弥	12397	223	723	生命值加成24%	治疗、能量回复、炼金返还、自身附魔
柯莱头像.png	柯莱	4星	弓	草	女	须弥	9787	200	601	攻击力加成24.0%	技能延长、滑翔消耗减少、精通加成
提纳里头像.png	提纳里	5星	弓	草	男	须弥	10850	268	630	草元素伤害加成28.8%	自身伤害提升、特产探索、精通加成、嘲讽
旅行者/草头像.png	旅行者/草	5星	单手剑	草	男/女	其它	10875	212	683	攻击力加成24%	能量恢复、技能延长、精通加成、伤害提升、属性变换
鹿野院平藏头像.png	鹿野院平藏	4星	法器	风	男	稻妻	10657	225	684	风元素伤害加成24%	聚怪、精通加成、冲刺消耗减少、能量恢复、自身暴击提升、自身爆伤提升、自身攻速提升
久岐忍头像.png	久岐忍	4星	单手剑	雷	女	稻妻	12289	212	751	生命值加成24%	治疗、派遣、技能延长、自身伤害提升、生命损耗
夜兰头像.png	夜兰	5星	弓	水	女	璃月	14450	244	548	暴击率19.2%	派遣、加血、伤害提升、协同攻击、快速移动
神里绫人头像.png	神里绫人	5星	单手剑	水	男	稻妻	13715	299	769	暴击伤害38.4%	自身伤害提升、元素转化、烹饪、攻速提升、能量恢复、武器幻化
八重神子头像.png	八重神子	5星	法器	雷	女	稻妻	10372	340	569	暴击率19.2%	伤害提升、炼金返还、能量恢复、无视防御
申鹤头像.png	申鹤	5星	长柄武器	冰	女	璃月	12993	304	830	攻击力加成28.8%	减抗、伤害提升、爆伤提升、派遣、技能延长、自身伤害提升、倍率附加
云堇头像.png	云堇	4星	长柄武器	岩	女	璃月	10657	191	734	元素充能26.7%	护盾、攻速提升、伤害提升、烹饪、弹反、冷却减少、倍率附加
五郎头像.png	五郎	4星	弓	岩	男	稻妻	9570	183	648	岩元素伤害加成24%	治疗、加防、抗打断、爆伤提升、特产探索、技能延长、冷却减少、自身伤害提升、自身倍率附加
荒泷一斗头像.png	荒泷一斗	5星	双手剑	岩	男	稻妻	12858	227	959	暴击率19.2%	嘲讽、加攻、加防、岩造物、元素转化、伐木产出、能量恢复、抗性降低、自身爆伤提升、自身伤害提升、自身攻速提升、冷却减少、自身倍率附加
托马头像.png	托马	4星	长柄武器	火	男	稻妻	10331	202	751	攻击力加成24%	护盾、伤害提升、钓鱼、技能延长、冷却减少、协同攻击、能量恢复
珊瑚宫心海头像.png	珊瑚宫心海	5星	法器	水	女	稻妻	13471	234	657	水元素伤害加成28.8%	治疗、游泳消耗减少、自身伤害提升、自身抗打断、能量恢复
埃洛伊头像.png	埃洛伊	5星	弓	冰	女	其它	10899	234	676	冰元素伤害加成28.8%	加攻、自身伤害提升、生物亲和、减攻、元素转化
雷电将军头像.png	雷电将军	5星	长柄武器	雷	女	稻妻	12907	337	789	元素充能32%	加攻、伤害提升、能量回复、冷却缩减、突破返还、协同攻击、自身抗打断、自身伤害提升、感电免疫、武器幻化、无视防御
九条裟罗头像.png	九条裟罗	4星	弓	雷	女	稻妻	9570	195	628	攻击力加成24%	派遣、能量回复、加攻、爆伤提升、冷却减少
早柚头像.png	早柚	4星	双手剑	风	女	稻妻	11854	244	745	元素精通96	治疗、生物亲和、快速移动、能量恢复
宵宫头像.png	宵宫	5星	弓	火	女	稻妻	10164	323	615	暴击率19.2%	加攻、自身伤害提升、摆设返还、元素转化
旅行者/雷头像.png	旅行者/雷	5星	单手剑	雷	男/女	其它	10875	212	683	攻击力加成24%	减抗、能量回复、冷却减少、属性变换
神里绫华头像.png	神里绫华	5星	单手剑	冰	女	稻妻	12858	342	784	暴击伤害38.4%	减防、炼金返还、快速移动、自身附魔、自身伤害提升
枫原万叶头像.png	枫原万叶	5星	单手剑	风	男	稻妻	13348	297	807	元素精通115	伤害提升、聚怪、冲刺消耗减少、精通加成、冷却减少、能量恢复、自身伤害提升、自身附魔
优菈头像.png	优菈	5星	双手剑	冰	女	蒙德	13226	342	751	暴击伤害38.4%	减抗、炼金返还、物理输出、自身伤害提升、自身抗打断、加防、冷却减少
烟绯头像.png	烟绯	4星	法器	火	女	璃月	9352	240	587	火元素伤害加成24%	特产探索、护盾、自身体力消耗降低、自身伤害提升、自身抗打断
罗莎莉亚头像.png	罗莎莉亚	4星	长柄武器	冰	女	蒙德	12289	240	710	攻击力加成24.0%	暴击提升、移速提升、移速提升（天赋）、减抗、能量恢复、技能延长
胡桃头像.png	胡桃	5星	长柄武器	火	女	璃月	15552	106.4	876	暴击伤害38.4%	暴击提升、烹饪、元素转化、自身治疗、自身抗打断、自身伤害提升、自身抗性提高、自身体力消耗降低、生命损耗
魈头像.png	魈	5星	长柄武器	风	男	璃月	12736	349	799	暴击率19.2%	位移、攀爬消耗减少、自身伤害提升、下落免疫、元素转化、生命损耗
甘雨头像.png	甘雨	5星	弓	冰	女	璃月	9797	335	630	暴击伤害38.4%	嘲讽、锻造返还、减抗、伤害提升、自身暴击提升
阿贝多头像.png	阿贝多	5星	单手剑	岩	男	蒙德	13226	251	876	岩元素伤害加成28.8%	炼金返还、伤害提升、精通加成、自身伤害提升、岩造物、协同攻击
辛焱头像.png	辛焱	4星	双手剑	火	女	璃月	11201	249	799	攻击力加成24%	护盾、烹饪、减抗、伤害提升、元素附着
钟离头像.png	钟离	5星	长柄武器	岩	男	璃月	14695	251	738	岩元素伤害加成28.8%	治疗、控制、减抗、护盾、护盾强效、锻造返还、自身伤害提升、自身抗打断、岩造物
达达利亚头像.png	达达利亚	5星	弓	水	男	至冬	13103	301	815	水元素伤害加成28.8%	天赋提升、能量恢复、武器幻化、冷却减少
迪奥娜头像.png	迪奥娜	4星	弓	冰	女	蒙德	9570	212	601	冰元素伤害加成24%	治疗、护盾、烹饪、移速提升、元素附着、精通加成、自身伤害提升、减攻、体力消耗降低、能量恢复
可莉头像.png	可莉	5星	法器	火	女	蒙德	10287	311	615	火元素伤害加成28.8%	特产探索、减防、能量回复、伤害提升、自身体力消耗降低
温迪头像.png	温迪	5星	弓	风	男	蒙德	10531	263	669	元素充能32%	聚怪、滑翔消耗减少、控制、能量回复、减抗、自身伤害提升
诺艾尔头像.png	诺艾尔	4星	双手剑	岩	女	蒙德	12071	191	799	防御力加成30%	护盾、治疗、烹饪、技能延长、自身伤害提升、元素转化
旅行者/风头像.png	旅行者/风	5星	单手剑	风	男/女	其它	10875	212	683	攻击力加成24%	属性变换、控制、减抗、自身治疗、聚怪
凯亚头像.png	凯亚	4星	单手剑	冰	男	蒙德	11636	223	792	元素充能26.7%	冲刺消耗减少、自身治疗、护盾、能量回复、技能延长、自身伤害提升、能量恢复
莫娜头像.png	莫娜	5星	法器	水	女	蒙德	10409	287	653	元素充能32%	控制、嘲讽、炼金返还、伤害提升、暴击提升、快速移动、自身伤害提升
班尼特头像.png	班尼特	4星	单手剑	火	男	蒙德	12397	191	771	元素充能26.7%	治疗、元素附着、派遣、加攻、元素附魔、伤害提升、冷却减少
旅行者/岩头像.png	旅行者/岩	5星	单手剑	岩	男/女	其它	10875	212	683	攻击力加成24%	岩造物、暴击提升、能量恢复、技能延长、冷却减少、属性变换
芭芭拉头像.png	芭芭拉	4星	法器	水	女	蒙德	9787	159	669	生命值加成24%	治疗、复活、烹饪、元素附着、伤害提升、体力消耗降低、技能延长、冷却减少
刻晴头像.png	刻晴	5星	单手剑	雷	女	璃月	13103	323	799	暴击伤害38.4%	位移、派遣、能量回复、自身附魔、自身伤害提升、自身暴击提升
北斗头像.png	北斗	4星	双手剑	雷	女	璃月	13050	225	648	雷元素伤害加成24%	护盾、游泳消耗减少、弹反、减抗、抗打断、自身伤害提升、伤害减免、协同攻击、自身攻速提升
重云头像.png	重云	4星	双手剑	冰	男	璃月	10984	223	648	攻击力加成24%	元素附魔、冷却缩减、派遣、减抗、攻速提升、自身伤害提升
旅行者头像.png	旅行者	5星	单手剑	无	男/女	其它	10875	212	683	攻击力加成24%	无
迪卢克头像.png	迪卢克	5星	双手剑	火	男	蒙德	12981	335	784	暴击率19.2%	锻造返还、自身附魔、自身伤害加成、自身攻速提升
七七头像.png	七七	5星	单手剑	冰	女	璃月	12368	287	922	治疗加成22.2%	治疗、复活、特产探索、减攻、自身伤害提升、能量恢复
琴头像.png	琴	5星	单手剑	风	女	蒙德	14695	239	769	治疗加成22.2%	聚怪、治疗、烹饪、控制、伤害减免、减抗、攻速提升、移速提升、元素附着、能量恢复
香菱头像.png	香菱	4星	长柄武器	火	女	璃月	10875	225	669	元素精通96	加攻、烹饪、减抗、伤害提升、技能延长
行秋头像.png	行秋	4星	单手剑	水	男	璃月	10222	202	758	攻击力加成24%	治疗、元素附着、炼金返还、减抗、抗打断、自身伤害提升、伤害减免、协同攻击、技能延长、能量恢复
雷泽头像.png	雷泽	4星	双手剑	雷	男	蒙德	11962	234	751	物理伤害加成30%	冲刺消耗减少、减防、自身伤害提升、自身抗性提高、自身抗打断、感电免疫、自身攻速提升、冷却减少、能量恢复、自身暴击提升
安柏头像.png	安柏	4星	弓	火	女	蒙德	9461	223	601	攻击力加成24%	滑翔消耗减少、加攻、移速提升、伤害提升、自身伤害提升、嘲讽
凝光头像.png	凝光	4星	法器	岩	女	璃月	9787	212	573	岩元素伤害加成24%	矿物探查、抗性提升、伤害提升、岩造物
菲谢尔头像.png	菲谢尔	4星	弓	雷	女	蒙德	9189	244	594	攻击力加成24%	派遣、自身治疗、技能延长、协同攻击
丽莎头像.png	丽莎	4星	法器	雷	女	蒙德	9570	232	573	元素精通96	减防、炼金返还、自身抗打断、能量恢复
砂糖头像.png	砂糖	4星	法器	风	女	蒙德	9244	170	703	风元素伤害加成24%	聚怪、控制、炼金返还、伤害提升、精通加成、技能延长、冷却减少
'''

weapon = """
裁叶萃光.png	裁叶萃光	单手剑	5星.png	限定祈愿	44	暴击伤害
19.2%	542	暴击伤害
88.2%	白月枝芒：暴击率提升4%/5%/6%/7%/8%；普通攻击造成元素伤害后，获得「裁叶」效果：普通攻击和元素战技造成的伤害提高，提高值相当于元素精通的120%/150%/180%/210%/240%。该效果在生效28次或12秒后消失，每12秒至多获得一次「裁叶」效果。
圣显之钥.png	圣显之钥	单手剑	5星.png	限定祈愿	44	生命值
14.4%	542	生命值
66.2%	沉入沙海的史诗：生命值提升20%/25%/30%/35%/40%。元素战技命中敌人时，将产生持续20秒的「宏大诗篇」效果：基于装备者生命值上限的0.12%/0.15%/0.18%/0.21%/0.24%，获得元素精通提升，该效果每0.3秒至多触发一次，至多叠加3层。该效果叠加至3层或3层的持续时间刷新时，将基于装备者生命值上限的0.2%/0.25%/0.3%/0.35%/0.4%，为队伍中附近所有角色提供非基础元素精通提升，持续20秒。
波乱月白经津.png	波乱月白经津	单手剑	5星.png	限定祈愿	46	暴击率
7.2%	608	暴击率
33.1%	白刃流转：获得12%/15%/18%/21%/24%所有元素伤害加成；队伍中附近的其他角色在施放元素战技时，会为装备该武器的角色产生1层「波穗」效果，至多叠加2层，每0.3秒最多触发1次。装备该武器的角色施放元素战技时，如果有积累的「波穗」效果，则将消耗已有的「波穗」，获得「波乱」：根据消耗的层数，每层提升20%/25%/30%/35%/40%普通攻击伤害，持续8秒。
雾切之回光.png	雾切之回光	单手剑	5星.png	限定祈愿	48	暴击伤害
9.6%	674	暴击伤害
44.1%	雾切御腰物：获得12%/15%/18%/21%/24%所有元素伤害加成，并能获得「雾切之巴印」的威势。雾切之巴印：持有1/2/3层雾切之巴印时，获得(8%/16％/28%)/‌(10%/20%/35%)/‌(12%/24%/42%)/‌(14%/28%/49%)/‌(16%/32%/56%)自己的元素类型的元素伤害加成。在下列情况下，角色将各获得1层雾切之巴印：普通攻击造成元素伤害时，持续5秒；施放元素爆发时，持续10秒；此外，角色元素能量低于100%时，将获得1层雾切之巴印，此雾切之巴印会在角色的元素能量充满时消失。每层雾切之巴印的持续时间独立计算。
苍古自由之誓.png	苍古自由之誓	单手剑	5星.png	限定祈愿	46	元素精通
43	608	元素精通
198	抗争的践行之歌：飘游风中的「千年的大乐章」的一部分。造成的伤害提升10%/12.5%/15%/17.5%/20%；触发元素反应时，角色获得一枚奋起之符，每0.5秒内至多触发一次，角色处于队伍后台也能触发。拥有2枚奋起之符时，将消耗所有奋起之符，使附近队伍中所有角色获得持续12秒的「千年的大乐章·抗争之歌」效果：普通攻击、重击、下落攻击造成的伤害提升16%/20%/24%/28%/32%，攻击力提升20%/25%/30%/35%/40%。触发后20秒内，无法再次获得奋起之符。「千年的大乐章」触发的多种数值效果中，同类数值效果不可叠加。
磐岩结绿.png	磐岩结绿	单手剑	5星.png	限定祈愿	44	暴击率
9.6%	542	暴击率
44.1%	护国的无垢之心：生命值提升20%/25%/30%/35%/40%。此外，基于装备该武器的角色生命值上限的1.2%/1.5%/1.8%/2.1%/2.4%,获得攻击力加成。
斫峰之刃.png	斫峰之刃	单手剑	5星.png	限定祈愿	46	攻击力%
10.8%	608	攻击力%
49.6%	金璋皇极：护盾强效提升20%/25%/30%/35%/40%。攻击命中后的8秒内，攻击力提升4%/5%/6%/7%/8%。该效果至多可叠加5层，每0.3秒只能触发一次。此外，处于护盾庇护下时，该效果的攻击力提升效果提高100%。
（注：需要角色在场触发，角色离场效果不提前结束，有护盾时的加成数值在后台不会退化为无护盾时的。）
风鹰剑.png	风鹰剑	单手剑	5星.png	祈愿	48	物理伤害加成
9.0%	674	物理伤害加成
41.3%	西风之鹰的抗争：攻击力提高20%/25%/30%/35%/40%；受到伤害时触发：高扬抗争旗号的西风鹰之魂苏醒，恢复同等与攻击力的100%/115%/130%/145%/160%生命值，并对周围的敌人造成200%/230%/260%/290%/320%攻击力的伤害。该效果每15秒只能触发一次。
天空之刃.png	天空之刃	单手剑	5星.png	祈愿	46	元素充能效率
12.0%	608	元素充能效率
55.1%	穿刺高天的利齿：暴击率提升4%/5%/6%/7%/8%；施放元素爆发时，获得破空之势：移动速度提升10%，攻击速度提升10%，普通攻击与重击命中时，额外造成20%/25%/30%/35%/40%攻击力的伤害，持续12秒。
灰河渡手.png	灰河渡手	单手剑	4星.png	NPC商店, 枫丹钓鱼协会兑换	42	元素充能效率
10.0%	510	元素充能效率
45.9%	铁骨：元素战技的暴击率提升8%/10%/12%/14%/16%；此外，施放元素战技后的5秒内，元素充能效率提升16%/20%/24%/28%/32%。
海渊终曲.png	海渊终曲	单手剑	4星.png	锻造	44	攻击力%
6.0%	565	攻击力%
27.6%	最终的崇高：施放元素战技时，攻击力提升12%/15%/18%/21%/24%，持续15秒，并赋予生命值上限25%的生命之契，该效果每10秒至多触发一次。生命之契清除时，基于清除值的2.4%/3%/3.6%/4.2%/4.8%提升至多150/188/225/263/300点攻击力，持续15秒。
狼牙.png	狼牙	单手剑	4星.png	纪行	42	暴击率
6.0%	510	暴击率
27.6%	苍狼北风：元素战技与元素爆发造成的伤害提升16%/20%/24%/28%/32%。元素战技命中敌人时，元素战技的暴击率提升2%/2.5%/3%/3.5%/4%；元素爆发命中敌人时，元素爆发的暴击率提升2%/2.5%/3%/3.5%/4%。上述两种效果各自持续10秒，至多叠加4次，每0.1秒至多触发一次。
东花坊时雨.png	东花坊时雨	单手剑	4星.png	3.3版本活动「秋津森夜试胆会」活动限定武器, 活动	42	元素精通
36	510	元素精通
165	怪谭·时雨心地一本足：攻击命中敌人后，会为命中的一名敌人施加「纸伞作祟」状态，持续10秒。该效果每15秒至多触发一次；持续期间该敌人被击败时，将清除该效果的冷却时间。装备者对处于「纸伞作祟」状态下的敌人造成的伤害提升16%/20%/24%/28%/32%。
西福斯的月光.png	西福斯的月光	单手剑	4星.png	限定祈愿	42	元素精通
36	510	元素精通
165	镇灵的低语：每10秒，产生如下效果：装备者的每点元素精通，都会为该角色提升0.036%/0.045%/0.054%/0.063%/0.072%非基础元素充能效率，并基于该提升的30%为队伍中附近的其他角色提升非基础元素充能效率，持续12秒，多件同名武器产生的此效果可以叠加。角色处于队伍后台时也能触发效果。
原木刀.png	原木刀	单手剑	4星.png	森林书第二章「梦中的苗圃」完成「兰那罗的世界」后获得兑换物「关于你与兰那罗的故事」，接着与梦之树附近的兰随尼兑换锻造图纸, 锻造	44	元素充能效率
6.7%	565	元素充能效率
30.6%	森林的瑞佑：触发燃烧、原激化、超激化、蔓激化、绽放、超绽放或烈绽放后，将在角色周围产生至多存在10秒的「种识之叶」。拾取种识之叶的角色元素精通提升60/75/90/105/120点，持续12秒。每20秒至多通过这种方式产生一枚种识之叶。角色处于队伍后台时也能触发。种识之叶的效果无法叠加。
笼钓瓶一心.png	笼钓瓶一心	单手剑	4星.png	任务, 枫红之章·第一幕「陌野不识故人」	42	攻击力%
9.0%	510	攻击力%
41.3%	澄澄一心传：普通攻击、重击或下落攻击命中敌人时，将卷起切落风，造成180%攻击力的范围伤害，并且使攻击力提升15%，持续8秒。该效果每8秒至多触发一次。
辰砂之纺锤.png	辰砂之纺锤	单手剑	4星.png	2.3版本活动「皑尘与雪影」活动限定武器, 活动	41	防御力
15.0%	454	防御力
69.0%	无垢之心：元素战技造成的伤害值提高，提高数值相当于防御力的40%/50%/60%/70%/80%。该效果每1.5秒最多触发一次，并将在元素战技造成伤害后的0.1秒后清除效果。
天目影打刀.png	天目影打刀	单手剑	4星.png	完成农民的宝藏的任务获得锻造图纸, 锻造	41	攻击力%
12.0%	454	攻击力%
55.1%	岩藏之胤：施放元素战技后，获得1个胤种，该效果每5秒至多触发一次。胤种持续30秒，至多同时存在3个。施放元素爆发后，会清除持有的所有胤种，并在2秒之后，基于消耗的胤种数量，每个为该角色恢复6/7.5/9/10.5/12点元素能量。
暗巷闪光.png	暗巷闪光	单手剑	4星.png	限定祈愿	45	元素精通
12	620	元素精通
55	街巷游侠：造成的伤害提升12%/15%/18%/21%/24%，受到伤害后，该伤害提升效果会失效5秒。
腐殖之剑.png	腐殖之剑	单手剑	4星.png	1.2版本活动「白垩与黑龙」活动限定武器, 活动	42	元素充能效率
10.0%	510	元素充能效率
45.9%	无尽的渴慕：元素战技造成的伤害增加16%/20%/24%/28%/32%，元素战技的暴击率提升6%/7.5%/9%/10.5%/12%。
试作斩岩.png	试作斩岩	单手剑	4星.png	冒险等阶10级奖励获取, 完成「星之归还」活动获取。, 锻造	44	物理伤害加成
7.5%	565	物理伤害加成
34.5%	碎石：普通攻击或重击命中时，攻击力（原为基础攻击力）和防御力提高4%/5%/6%/7%/8%，持续6秒，最多叠加4层。该效果每0.3秒只能触发一次。
黑剑.png	黑剑	单手剑	4星.png	纪行	42	暴击率
6.0%	510	暴击率
27.6%	「正义」：普通攻击与重击造成的伤害提升20%/25%/30%/35%/40%；此外普通攻击和重击暴击时，恢复等同于攻击力60/70/80/90/100%的生命值。该效果每5秒至多发动一次。
宗室长剑.png	宗室长剑	单手剑	4星.png	商城兑换	42	攻击力%
9%	510	攻击力%
41.3%	专注：攻击造成伤害时，暴击率提升8%/10%/12%/14%/16%，最多堆叠5次。攻击造成暴击后，移除已有的专注效果。
铁蜂刺.png	铁蜂刺	单手剑	4星.png	锻造	42	元素精通
36	510	元素精通
165	注能之刺：造成元素伤害后的6秒内，角色造成的伤害提高6%/7.5%/9%/10.5%/12%，该效果最多叠加2层。该效果每1秒可以触发一次。
笛剑.png	笛剑	单手剑	4星.png	祈愿	42	攻击力%
9.0%	510	攻击力%
41.3%	和弦：普通攻击或重击命中(敌人或动物)时，会获得一个和音。积攒了5个和音后，释放音律的力量，对周围的敌人造成100%/125%/150%/175%/200%攻击力的伤害。和音最多存在30秒，每0.5秒至多获得1个和音。
匣里龙吟.png	匣里龙吟	单手剑	4星.png	祈愿	42	攻击力%
9.0%	510	攻击力%
41.3%	踏火息雷：对处于火元素或雷元素影响下的敌人，造成的伤害提高20%/24%/28%/32%/36%。
祭礼剑.png	祭礼剑	单手剑	4星.png	祈愿	41	元素充能效率
13.3%	454	元素充能效率
61.3%	气定神闲：元素战技造成伤害时，有40%/50%/60%/70%/80%概率重置该技能的冷却时间，该效果每30/26/22/19/16秒只能触发一次。
降临之剑.png	降临之剑	单手剑	4星.png	“PlayStation Network”的玩家特典奖励	39	攻击力%
7.7%	440	攻击力%
35.2%	降世：仅在“PlayStation Network”游玩时生效。普通攻击与重击命中敌人后有50%概率在小范围内造成200%攻击力的伤害。该效果每10秒只能触发一次；此外，旅行者装备降临之剑时，攻击力提升66点。该武器技能效果初始即满级，无法精炼。
西风剑.png	西风剑	单手剑	4星.png	祈愿	41	元素充能效率
13.3%	454	元素充能效率
61.3%	顺风而行：攻击造成暴击时，有60%/70%/80%/90%/100%的几率产生少量元素微粒，能为角色恢复6点元素能量。该效果每12/10.5/9/7.5/6秒只能触发一次。
黑岩长剑.png	黑岩长剑	单手剑	4星.png	商城兑换	44	暴击伤害
8.0%	565	暴击伤害
36.8%	乘胜追击：击败敌人后，攻击力提升12%/15%/18%/21%/24%，持续30秒。该效果至多叠加三层，每层持续时间独立。
吃虎鱼刀.png	吃虎鱼刀	单手剑	3星.png	与稻妻铁匠铺处的天目十五对话获得, 宝箱	39	攻击力%
7.7%	401	攻击力%
35.2%	决：攻击命中时，有50%的概率对单个敌人造成240%/280%/320%/360%/400%攻击力的伤害。该效果每15/14/13/12/11秒只能触发一次。
黎明神剑.png	黎明神剑	单手剑	3星.png	任务（凯亚传说任务）, 祈愿	39	暴击伤害
10.2%	401	暴击伤害
46.9%	激励：生命值高于90%时，暴击率提升14%/17.5%/21%/24.5%/28%
旅行剑.png	旅行剑	单手剑	3星.png	宝箱	40	防御力
6.4%	448	防御力
29.3%	旅程：获得元素晶球或元素微粒时，恢复1%/1.25%/1.5%/1.75%/2%生命值。
暗铁剑.png	暗铁剑	单手剑	3星.png	与璃月港快刀陈对话（全图仅一把，建议收藏）, 对话	39	元素精通
31	401	元素精通
141	过载：触发超载、超导、感电，原激化，超激化，超绽放或雷元素扩散反应后的12秒内，攻击力提高20%/25%/30%/35%/40%。
冷刃.png	冷刃	单手剑	3星.png	祈愿	39	攻击力%
7.7%	401	攻击力%
35.2%	止水融冰：对处于水元素或冰元素影响下的敌人，造成的伤害提高12%/15%/18%/21%/24%。
飞天御剑.png	飞天御剑	单手剑	3星.png	与绝云间到到庆云顶之间的亭子下的判官儿对话, 对话, 祈愿	38	元素充能效率
11.3%	354	元素充能效率
52.1%	决心：施放元素爆发后，提高12%/15%/18%/21%/24%攻击力和移动速度，持续15秒。
银剑.png	银剑	单手剑	2星.png	商店购买, 宝箱	33	无	243	无	无
无锋剑.png	无锋剑	单手剑	1星.png	初始武器赠送, 商店购买（锻造商店学徒处）, 宝箱	23	无	185	无	无
苇海信标.png	苇海信标	双手剑	5星.png	限定祈愿	46	暴击率
7.2%	608	暴击率
33.1%	沙海守望：元素战技命中敌人后，攻击力提升20%/25%/30%/35%/40%，持续8秒；受到伤害后，攻击力提升20%/25%/30%/35%/40%，持续8秒。上述2种效果角色处于队伍后台时也能触发。此外，不处于护盾庇护下时，生命值上限提高32%/40%/48%/56%/64%。
赤角石溃杵.png	赤角石溃杵	双手剑	5星.png	限定祈愿	44	暴击伤害
19.2%	542	暴击伤害
88.2%	御伽大王御伽话：防御力提高28%/35%/42%/49%/56%；普通攻击与重击造成的伤害值提高，提高数值相当于防御力的40%/50%/60%/70%/80%。
松籁响起之时.png	松籁响起之时	双手剑	5星.png	限定祈愿	49	物理伤害加成
4.5%	741	物理伤害加成
20.7%	揭旗的叛逆之歌：飘游风中的「千年的大乐章」的一部分。攻击力提升16%/20%/24%/28%/32%；普通攻击或重击命中敌人时，角色获得一枚低语之符，每0.3秒内至多触发一次。拥有4枚低语之符时，将消耗所有低语之符，使附近队伍中所有角色获得持续12秒的「千年的大乐章·揭旗之歌」效果：普通攻击速度提升12%/15%/18%/21%/24%，攻击力提升20%/25%/30%/35%/40%。触发后20秒内，无法再次获得低语之符。「千年的大乐章」触发的多种数值效果中，同类数值效果不可叠加。
无工之剑.png	无工之剑	双手剑	5星.png	限定祈愿	46	攻击力%
10.8%	608	攻击力%
49.6%	金璋皇极：护盾强效提升20%/25%/30%/35%/40%。攻击命中后的8秒内，攻击力提升4%/5%/6%/7%/8%。该效果至多可叠加5层，每0.3秒只能触发一次。此外，处于护盾庇护下时，该效果的攻击力提升效果提高100%。
天空之傲.png	天空之傲	双手剑	5星.png	祈愿	48	元素充能效率
8%	674	元素充能效率
36.8%	斩裂晴空的龙脊：造成的伤害提高8%/10%/12%/14%/16%；施放元素爆发后，普通攻击和重击命中时会发出真空刃，对路径上的敌人造成80%/100%/120%/140%/160%攻击力的伤害，持续20秒或直至发出8次真空刃。
狼的末路.png	狼的末路	双手剑	5星.png	祈愿	46	攻击力%
10.8%	608	攻击力%
49.6%	如狼般狩猎者：攻击力提高20%/25%/30%/35%/40%；攻击命中生命值低于30%的敌人时，队伍中所有成员的攻击力提高40%/50%/60%/70%/80%，持续12秒。该效果30秒只能触发一次。
浪影阔剑.png	浪影阔剑	双手剑	4星.png	锻造	42	攻击力%
9.0%	510	攻击力%
41.3%	巡航的白浪：受到治疗后，攻击力提升24%/30%/36%/42%/48%，持续8秒。角色处于队伍后台也能触发。
聊聊棒.png	聊聊棒	双手剑	4星.png	纪行	44	暴击率
4.0%	565	暴击率
18.4%	「伶牙俐齿」：承受火元素附着后的15秒内，攻击力提升16%/20%/24%/28%/32%，每12秒至多触发一次；承受水元素、冰元素、雷元素或草元素附着后的15秒内，所有元素伤害加成提升12%/15%/18%/21%/24%，每12秒至多触发一次。
饰铁之花.png	饰铁之花	双手剑	4星.png	3.5版本活动「风花的呼吸」活动限定武器, 活动	44	元素精通
24	565	元素精通
110	风与花的密语：元素战技命中敌人或触发元素反应后的8秒内，攻击力提升12%/15%/18%/21%/24%，元素精通提升48/60/72/84/96点。
玛海菈的水色.png	玛海菈的水色	双手剑	4星.png	限定祈愿	42	元素精通
36	510	元素精通
165	沙上楼阁：每10秒，产生如下效果：基于装备者的元素精通的24%/30%/36%/42%/48%，提升该角色的攻击力，并基于该提升的30%为队伍中附近的其他角色提升攻击力，持续12秒，多件同名武器产生的此效果可以叠加。角色处于队伍后台时也能触发效果。
森林王器.png	森林王器	双手剑	4星.png	锻造	44	元素充能效率
6.7%	565	元素充能效率
30.6%	森林的瑞佑：触发燃烧、原激化、超激化、蔓激化、绽放、超绽放或烈绽放后，将在角色周围产生至多存在10秒的「种识之叶」。拾取种识之叶的角色元素精通提升60/75/90/105/120点，持续12秒。每20秒至多通过这种方式产生一枚种识之叶。角色处于队伍后台时也能触发。种识之叶的效果无法叠加。
恶王丸.png	恶王丸	双手剑	4星.png	限定祈愿	42	攻击力%
9.0%	510	攻击力%
41.3%	驭浪的海祇民：队伍中所有角色的元素能量上限的总和，每1点能使装备此武器的角色的元素爆发造成的伤害提高0.12%/0.15%/0.18%/0.21%/0.24%，通过这种方式，元素爆发造成的伤害至多提高40%/50%/60%/70%/80%。
衔珠海皇.png	衔珠海皇	双手剑	4星.png	2.1版本活动「韶光抚月」活动限定武器, 活动	41	攻击力%
12%	454	攻击力%
55.1%	海洋的胜利：元素爆发造成的伤害提升12%/15%/18%/21%/24%。元素爆发命中敌人时，有100%概率召唤大鲔冲击，造成100%/125%/150%/175%/200%攻击力的范围伤害。该效果每15秒至多触发一次。
桂木斩长正.png	桂木斩长正	双手剑	4星.png	踏鞴沙防护罩解除（踏鞴物语任务相关）后搜集三把钥匙, 锻造	42	元素充能效率
10%	510	元素充能效率
45.9%	名士振舞：元素战技造成的伤害提升6%/7.5%/9%/10.5%/12%。元素战技命中后，角色流失3点元素能量，并在此后的6秒内，每2秒恢复3/3.5/4/4.5/5点元素能量。该效果每10秒至多触发一次，角色处于队伍后台也能触发。(武器特效与追忆之注连四件套的触发机制不同。元素战技命中后无论有没有能量可供扣除，都能触发后续回能。)
千岩古剑.png	千岩古剑	双手剑	4星.png	限定祈愿	42	攻击力%
9%	510	攻击力%
41.3%	千岩诀·同心：队伍中每有一位璃月角色，装备该武器的角色便获得7%/8%/9%/10%/11%攻击力提升与3%/4%/5%/6%/7%暴击率提升。至多获得4层提升效果。
雪葬的星银.png	雪葬的星银	双手剑	4星.png	任务后龙脊雪山密室内拔出, 锻造	44	物理伤害加成
7.5%	565	物理伤害加成
34.5%	霜葬：普通攻击与重击命中敌人时，有60%/70%/80%/90%/100%概率在敌人上方生成恒冰晶核并坠落，造成80%/95%/110%/125%/140%攻击力的范围伤害。若敌人处于冰元素影响下，则造成200%/240%/280%/320%/360%攻击力的伤害。该效果每10秒至多触发一次。
白影剑.png	白影剑	双手剑	4星.png	锻造	42	防御力
11.3%	510	防御力
51.7%	注能之锋：普通攻击和重击命中后，攻击力和防御力提高6%/7.5%/9%/10.5%/12%。该效果持续6秒，最多叠加4层，每0.5秒只能触发一次。
雨裁.png	雨裁	双手剑	4星.png	祈愿	42	元素精通
36	510	元素精通
165	止水息雷：对处于水元素或雷元素影响下的敌人，造成的伤害提高20％/24%/28%/32%/36%。
祭礼大剑.png	祭礼大剑	双手剑	4星.png	祈愿	44	元素充能效率
6.7%	565	元素充能效率
30.6%	气定神闲：元素战技造成伤害时，有40%/50%/60%/70%/80%概率重置该技能的冷却时间，该效果每30/26/22/19/16秒只能触发一次。
黑岩斩刀.png	黑岩斩刀	双手剑	4星.png	商城兑换	42	暴击伤害
12.0%	510	暴击伤害
55.1%	乘胜追击：击败敌人后，攻击力提升12%/15%/18%/21%/24%，持续30秒。该效果至多叠加3层，每层持续时间独立。
宗室大剑.png	宗室大剑	双手剑	4星.png	商城兑换	44	攻击力%
6%	565	攻击力%
27.6%	专注：攻击造成伤害时，暴击率提升8%/10%/12%/14%/16%，最多堆叠5次。攻击造成暴击后，移除已有的专注效果。
螭骨剑.png	螭骨剑	双手剑	4星.png	纪行	42	暴击率
6.0%	510	暴击率
27.6%	破浪：角色在场上时，每4秒提升6%/7%/8%/9%/10%造成的伤害，3%/2.7%/2.4%/2.2%/2%受到的伤害。该效果最多叠加5层，不随角色退场重置，受到伤害后会减少1层效果。
西风大剑.png	西风大剑	双手剑	4星.png	祈愿	41	元素充能效率
13.3%	454	元素充能效率
61.3%	顺风而行：攻击造成暴击时，有60%/70%/80%/90%/100%的几率产生少量元素微粒，能为角色恢复6点元素能量。该效果每12/10.5/9/7.5/6秒只能触发一次。
试作古华.png	试作古华	双手剑	4星.png	锻造	44	攻击力%
6.0%	565	攻击力%
27.6%	粉碎：普通攻击和重击命中时，有50%的概率对小范围内的敌人造成240%/300%/360%/420%/480%攻击力的额外伤害。该效果每15秒只能触发一次。
钟剑.png	钟剑	双手剑	4星.png	祈愿	42	生命值
9.0%	510	生命值
41.3%	叛逆的守护者：受到伤害时，生成一个伤害吸收等同于生命上限20%/23%/26%/29%/32%的护盾，持续10秒或者直到护盾失效，每45秒只能触发一次。角色处于护盾庇护下时，造成的伤害提升12%/15%/18%/21%/24%。
沐浴龙血的剑.png	沐浴龙血的剑	双手剑	3星.png	祈愿	38	元素精通
41	354	元素精通
187	踏火息雷：对处于火元素或雷元素影响下的敌人，造成的伤害提高12%/15%/18%/21%/24%。
白铁大剑.png	白铁大剑	双手剑	3星.png	宝箱, 宝箱（蒙德）	39	防御力
9.6%	401	防御力
43.9%	收割：击败敌人时，恢复8%/10%/12%/14%/16%生命值。
飞天大御剑.png	飞天大御剑	双手剑	3星.png	孤云阁附近拔出, 宝箱, （璃月区域宝箱）	39	物理伤害加成
9.6%	401	物理伤害加成
43.9%	勇气：普通攻击和重击命中时，攻击力提高6%/7%/8%/9%/10%，持续6秒，最多叠加4层，该效果每0.5秒只能触发一次。
以理服人.png	以理服人	双手剑	3星.png	祈愿	39	攻击力%
7.7%	401	攻击力%
35.2%	有话直说：施放元素战技后，普通攻击和重击命中时会在小范围内额外造成60%/75%/90%/105%/120%攻击力的伤害。该效果持续15秒，伤害每3秒只能触发一次。
铁影阔剑.png	铁影阔剑	双手剑	3星.png	祈愿	39	生命值
7.7%	401	生命值
35.2%	不屈：生命值低于70%/75%/80%/85%/90%时，重击不会轻易被打断，并提高30%/35%/40%/45%/50%重击伤害。
佣兵重剑.png	佣兵重剑	双手剑	2星.png	商店购买, 宝箱	33	无	243	无	无
训练大剑.png	训练大剑	双手剑	1星.png	初始武器赠送, 商店购买, 宝箱	23	无	185	无	无
最初的大魔术.png	最初的大魔术	弓	5星.png	限定祈愿	46	暴击伤害
14.4%	608	暴击伤害
66.2%	伟大者帕西法尔：重击造成的伤害提升16%/20%/24%/28%/32%；队伍中每存在一位与装备者元素类型相同的角色（包括装备者自身），将获得1层「手法」效果；每存在一位元素类型不同的角色，将获得1层「演技」效果。处于1/2/3层及以上「手法」效果下时，攻击力提升(16/32/48%)/‌(20/40/60%)/‌(24/48/72%)/‌(28/56/84%)/‌(32/64/96%)；处于1/2/3层及以上「演技」效果下时，移动速度提升(4/7/10%)/‌(6/9/12%)/‌(8/11/14%)/‌(10/13/16%)/‌(12/15/18%)。
猎人之径.png	猎人之径	弓	5星.png	限定祈愿	44	暴击率
9.6%	542	暴击率
44.1%	兽径的终点：获得12%/15%/18%/21%/24%所有元素伤害加成。重击命中敌人后,将获得「无休止的狩猎」：重击造成的伤害值提高，提高值相当于元素精通数值的160%/200%/240%/280%/320%。该效果将在生效12次或10秒后消失，每12秒至多获得一次无休止的狩猎。
若水.png	若水	弓	5星.png	限定祈愿	44	暴击伤害
19.2%	542	暴击伤害
88.2%	洗濯诸类之形：生命值提升16%/20%/24%/28%/32%。周围存在敌人时，装备该武器的角色造成的伤害都会提升20%/25%/30%/35%/40%，不论该角色处于场上或是处于队伍后台。
冬极白星.png	冬极白星	弓	5星.png	限定祈愿	46	暴击率
7.2%	608	暴击率
33.1%	极昼的先兆者：元素战技和元素爆发造成的伤害提高12%/15%/18%/21%/24%；普通攻击、重击、元素战技或元素爆发命中敌人后，将产生1层持续12秒的「白夜极星」效果。处于1/2/3/4层「白夜极星」效果下时，攻击力将提高(10/20/30/48%)/‌(12.5/25/37.5/60%)/‌(15/30/45/72%)/‌(17.5/35/52.5/84%)/‌(20/40/60/96%)。由普通攻击、重击、元素战技或元素爆发产生的「白夜极星」将分别独立存在。
飞雷之弦振.png	飞雷之弦振	弓	5星.png	限定祈愿	46	暴击伤害
14.4%	608	暴击伤害
66.2%	飞雷御执：攻击力提高20%/25%/30%/35%/40%，并能获得「飞雷之巴印」的威势。飞雷之巴印：持有1/2/3层飞雷之巴印时，普通攻击造成的伤害提高(12/24/40%)/‌(15/30/50%)/‌(18/36/60%)/‌(21/42/70%)/‌(24/48/80%)。在下列情况下，角色将各获得1层飞雷之巴印：普通攻击造成伤害时，持续5秒；施放元素战技时，持续10秒；此外，角色元素能量低于100%时，将获得1层飞雷之巴印，此飞雷之巴印会在角色的元素能量充满时消失。每层飞雷之巴印的持续时间独立计算。
终末嗟叹之诗.png	终末嗟叹之诗	弓	5星.png	限定祈愿	46	元素充能效率
12.0%	608	元素充能效率
55.1%	别离的思念之歌：飘游风中的「千年的大乐章」的一部分。元素精通提高60/75/90/105/120点；元素战技或元素爆发命中敌人时，角色获得一枚追思之符，每0.2秒内至多触发一次，角色处于队伍后台也能触发。拥有4枚追思之符时，将消耗所有追思之符，使附近的队伍中所有角色获得持续12秒的「千年的大乐章·别离之歌」效果：元素精通提高100/125/150/175/200点，攻击力提升20%/25%/30%/35%/40%。触发后20秒内，无法再次获得追思之符。「千年的大乐章」触发的多种数值效果中，同类数值效果不可叠加。
天空之翼.png	天空之翼	弓	5星.png	祈愿	48	暴击率
4.8%	674	暴击率
22.1%	回响长天的诗歌：暴击伤害提高20%/25%/30%/35%/40%；攻击命中时有60%/70%/80%/90%/100%概率造成125%攻击力的小范围物理伤害，该效果每4秒/3.5秒/3秒/2.5秒/2秒只能触发一次。
阿莫斯之弓.png	阿莫斯之弓	弓	5星.png	祈愿	46	攻击力%
10.8%	608	攻击力%
49.6%	矢志不忘：普通攻击和重击造成的伤害提升12%/15%/18%/21%/24%；箭矢发射后每经过0.1秒，伤害还会提升8%/10%/12%/14%/16%。至多提升5次。
静谧之曲.png	静谧之曲	弓	4星.png	锻造	42	攻击力%
9.0%	510	攻击力%
41.3%	深海弦振：受到治疗后，造成的伤害提升16%/20%/24%/28%/32%，持续8秒。角色处于队伍后台也能触发。
烈阳之嗣.png	烈阳之嗣	弓	4星.png	纪行	44	暴击率
4.0%	565	暴击率
18.4%	阳炎古道：重击命中敌人后，会向命中的敌人降下阳炎矢，造成攻击力60%/75%/90%/105%/120%的伤害，并为受到阳炎矢伤害的敌人施加持续10秒的灼心效果。装备者的重击对处于灼心状态下的敌人造成的伤害提升28%/35%/42%/49%/56%。阳炎矢每10秒至多触发一次。
鹮穿之喙.png	鹮穿之喙	弓	4星.png	3.7版本活动「决斗！召唤之巅！」活动限定武器。, 活动	44	攻击力%
6.0%	565	攻击力%
27.6%	秘智之眸的青睐：重击命中敌人后的6秒内，角色元素精通提升40/50/60/70/80点。该效果至多叠加2层，每0.5秒至多触发一次。
竭泽.png	竭泽	弓	4星.png	NPC商店, 须弥钓鱼协会兑换	42	元素充能效率
10%	510	元素充能效率
45.9%	网破：施放元素战技后,将触发「沿洄」效果,在攻击命中敌人时造成80%/100%/120%/140%/160%攻击力的范围伤害,该效果将在15秒或触发3次范围伤害后移除。每2秒至多通过这种方式造成一次范围伤害,每12秒至多触发一次「沿洄」。
王下近侍.png	王下近侍	弓	4星.png	锻造	41	攻击力%
12.0%	454	攻击力%
55.1%	迷宫之王的教导：施放元素战技或元素爆发时，将获得「森林教诲」的效果，元素精通提升60/80/100/120/140点，持续12秒。该效果将在切换角色时移除。森林教诲的持续时间结束或被移除时，将对附近一名敌人造成100%/120%/140%/160%/180%攻击力的伤害。森林教诲每20秒至多触发一次。
落霞.png	落霞	弓	4星.png	2.7版本活动「危途疑踪」活动限定武器。, 活动	44	元素充能效率
6.7%	565	元素充能效率
30.6%	渊中霞彩：具有夕暮、流霞、朝晖三种状态，分别能使造成的伤害提升(6%/7.5%/9%/10.5%/12%)/‌(10%/12.5%/15%/17.5%/20%)/‌(14%/17.5%/21%/24.5%/28%)。攻击命中敌人后，将转换为下一种状态，每7秒至多转换一次状态。装备该武器的角色处于队伍后台时该效果依旧能触发转换。
曚云之月.png	曚云之月	弓	4星.png	限定祈愿	44	攻击力%
6.0%	565	攻击力%
27.6%	驭浪的海祇民：队伍中所有角色的元素能量上限的总和，每1点能使装备此武器的角色的元素爆发造成的伤害提高0.12%/0.15%/0.18%/0.21%/0.24%，通过这种方式，元素爆发造成的伤害至多提高40%/50%/60%/70%/80%。
掠食者.png	掠食者	弓	4星.png	2.1版本更新完后，旅行者通过PlayStation平台登录游戏，可在冒险等阶达到20级后，通过游戏内邮件免费获得该武器	42	攻击力%
9.0%	510	攻击力%
41.3%	强力攻击：·仅在“PlayStation NetWork”游玩时生效。
·对敌人造成冰元素伤害后，普通攻击与重击造成的伤害提高10%，效果持续6秒，至多叠加2次；此外，埃洛伊装备掠食者时，攻击力提升66点。

破魔之弓.png	破魔之弓	弓	4星.png	奇怪的海螺兑换阿敬的宝箱大奖可获得锻造图纸<神无冢·踏鞴砂>上面海螺屋。, 锻造	41	攻击力%
12.0%	454	攻击力%
55.1%	浅濑之弭：普通攻击造成的伤害提升16%/20%/24%/28%/32%，重击造成的伤害提升12%/15%/18%/21%/24%。当装备该武器的角色元素能量等于100%时，这个效果提升100%。
幽夜华尔兹.png	幽夜华尔兹	弓	4星.png	限定祈愿	42	物理伤害加成
11.3%	510	物理伤害加成
51.7%	极夜二重奏：普通攻击命中敌人后的5秒内，元素战技造成的伤害提升20%/25%/30%/35%/40%；元素战技命中敌人后的5秒内，普通攻击造成的伤害提升20%/25%/30%/35%/40%。
暗巷猎手.png	暗巷猎手	弓	4星.png	限定祈愿	44	攻击力%
6.0%	565	攻击力%
27.6%	街巷伏击：装备该武器的角色处于队伍后台时，每1秒角色造成的伤害提升2%/2.5%/3%/3.5%/4%,最多通过这种方式获得20%/25%/30%/35%/40%的伤害提升；在场上超过4秒后，上述伤害提升效果每1秒会流失4%/5%/6%/7%/8%，直到降低至0%。
风花之颂.png	风花之颂	弓	4星.png	1.4版本活动「风花的邀约」活动限定武器, 活动	42	元素精通
36	510	元素精通
165	风花之愿：施放元素战技时，获得风之花的悠古愿望加持，攻击力提升16%/20%/24%/28%/32%，持续6秒。
黑岩战弓.png	黑岩战弓	弓	4星.png	商城兑换	44	暴击伤害
8.0%	565	暴击伤害
36.8%	乘胜追击：击败敌人后,攻击力提升12%/15%/18%/21%/24%,持续30秒。该效果至多叠加3层,每层持续时间独立。
宗室长弓.png	宗室长弓	弓	4星.png	商城兑换	42	攻击力%
9.0%	510	攻击力%
41.3%	专注：攻击造成伤害时，暴击率提升8%/10%/12%/14%/16%，最多堆叠5次。攻击造成暴击后，移除已有的专注效果。
试作澹月.png	试作澹月	弓	4星.png	锻造	42	攻击力%
9.0%	510	攻击力%
41.3%	离簇不归：瞄准射击时，若命中要害，则提升10%移动速度与36%/45%/54%/63%/72%攻击力，持续10秒。
祭礼弓.png	祭礼弓	弓	4星.png	祈愿	44	元素充能效率
6.7%	565	元素充能效率
30.6%	气定神闲：元素战技造成伤害时，有40％/50%/60%/70%/80%的概率重置该技能的冷却时间，该效果每30/26/22/19/16秒只能触发一次。
苍翠猎弓.png	苍翠猎弓	弓	4星.png	纪行	42	暴击率
6.0%	510	暴击率
27.6%	苍翠之风：普通攻击与重击命中时，有50%几率生成一个风之眼，持续吸引周围敌人，并对其中的敌人每0.5秒造成40%/50%/60%/70%/80%攻击力的伤害。该效果持续4秒，每14/13/12/11/10秒至多触发一次。
绝弦.png	绝弦	弓	4星.png	祈愿	42	元素精通
36	510	元素精通
165	无矢之歌：元素战技与元素爆发的伤害提高24％/30%/36%/42%/48%。
弓藏.png	弓藏	弓	4星.png	祈愿	42	攻击力%
9.0%	510	攻击力%
41.3%	速射弓斗：普通攻击伤害提升40%/50%/60%/70%/80%，重击伤害下降10%。
西风猎弓.png	西风猎弓	弓	4星.png	任务巨龙与自由之歌, 祈愿	41	元素充能效率
13.3%	454	元素充能效率
61.3%	顺风而行：攻击造成暴击时，有60%/70%/80%/90%/100%的几率产生少量元素微粒，能为角色恢复6点元素能量。该效果每12/10.5/9/7.5/6秒只能触发一次。
钢轮弓.png	钢轮弓	弓	4星.png	锻造	41	物理伤害加成
15.0%	454	物理伤害加成
69.0%	注能之矢：普通攻击与重击命中时，提升4%/5%/6%/7%/8%攻击力与1.2%/1.5%/1.8%/2.1%/2.4%普通攻击速度。该效果持续6秒，最多可以叠加4层，每0.3秒只能触发一次。
信使.png	信使	弓	3星.png	宝箱, （璃月区域宝箱）	40	暴击伤害
6.8%	448	暴击伤害
31.2%	飞矢传书：瞄准射击时，若命中要害，则额外造成100%/125%/150%/175%/200%攻击力的伤害，该伤害必定暴击。此效果每10秒只能触发一次。
弹弓.png	弹弓	弓	3星.png	祈愿	38	暴击率
6.8%	354	暴击率
31.2%	弹弓：普通攻击和瞄准射击时，箭矢若在发射后的0.3秒内击中敌人，则造成的伤害增加36%/42%/48%/54%/60%；否则，造成的伤害下降10%。
反曲弓.png	反曲弓	弓	3星.png	与稻妻离岛港口中野对话, 与须弥化城郭池边的希琳对话, 宝箱, 对话	38	生命值
10.2%	354	生命值
46.9%	收割：击败敌人时，恢复8%/10%/12%/14%/16%生命值。
神射手之誓.png	神射手之誓	弓	3星.png	祈愿	39	暴击伤害
10.2%	401	暴击伤害
46.9%	精准：针对要害造成的伤害提升24%/30%/36%/42%/48%。
鸦羽弓.png	鸦羽弓	弓	3星.png	祈愿	40	元素精通
20	448	元素精通
94	踏火止水：对处于火元素或水元素影响下的敌人，造成的伤害提高12%/15%/18%/21%/24%
历练的猎弓.png	历练的猎弓	弓	2星.png	商店购买, 宝箱	33	无	243	无	无
猎弓.png	猎弓	弓	1星.png	初始武器赠送, 商店购买, 宝箱	23	无	185	无	无
碧落之珑.png	碧落之珑	法器	5星.png	限定祈愿	46	生命值
10.8％	608	生命值
49.6％	定土玉圭：施放元素爆发或创造护盾后的3秒内，将产生「定土玉圭」效果：每2.5秒恢复4.5/5/5.5/6/6.5点元素能量，并基于装备者的生命值上限，每1000点使其对应元素类型的元素伤害加成提高0.3%/0.5%/0.7%/0.9%/1.1%，至多提高12%/20%/28%/36%/44%。装备该武器的角色处于队伍后台时，依然能产生「定土玉圭」效果。
图莱杜拉的回忆.png	图莱杜拉的回忆	法器	5星.png	限定祈愿	48	暴击伤害
9.6%	674	暴击伤害
44.1%	堙没的蓝宝石泪滴：普通攻击速度提升10%/12.5%/15%/17.5%/20%；施放元素战技后的14秒内：普通攻击造成的伤害每1秒提升4.8%/6%/7.2%/8.4%/9.6%；普通攻击命中敌人后，普通攻击造成的伤害提升9.6%/12%/14.4%/16.8%/19.2%，该效果每0.3秒至多触发1次。持续期间内，普通攻击造成的伤害至多通过上述效果提升至48%/60%/72%/84%/96%。角色退场时将移除效果，再次施放元素战技时会先移除原有的效果。
千夜浮梦.png	千夜浮梦	法器	5星.png	限定祈愿	44	元素精通
58	542	元素精通
265	千夜的曙歌：队伍中每个其他角色，都会依据元素类型与装备者相同与否，为装备者提供提升效果。若相同则元素精通提升32/40/48/56/64点；若不同则装备者元素类型的元素伤害加成提升10%/14%/18%/22%/26%。上述提升效果每种至多叠加3层。此外，队伍中装备者以外的附近角色的元素精通提升40/42/44/46/48点，多件同名武器产生的此效果可以叠加。
神乐之真意.png	神乐之真意	法器	5星.png	限定祈愿	46	暴击伤害
14.4%	608	暴击伤害
66.2%	神樱神游神乐舞：施放元素战技时，将获得「神乐舞」的效果，使装备该武器的角色的元素战技造成的伤害提高12%/15%/18%/21%/24%，该效果持续16秒，至多叠加3层。持有3层时，该角色获得12%/15%/18%/21%/24%所有元素伤害加成。
不灭月华.png	不灭月华	法器	5星.png	限定祈愿	46	生命值
10.8%	608	生命值
49.6%	白夜皓月：治疗加成提升10%/12.5%/15%/17.5%/20%；普通攻击造成的伤害增加，增加值为装备该武器的角色生命值上限的1%/1.5%/2%/2.5%/3%。在施放元素爆发后的12秒内，普通攻击命中敌人时恢复0.6点元素能量，每0.1秒至多通过这种方式恢复一次元素能量。
尘世之锁.png	尘世之锁	法器	5星.png	限定祈愿	46	攻击力%
10.8%	608	攻击力%
49.6%	金璋皇极：护盾强效提升20%/25%/30%/35%/40%。攻击命中后的8秒内，攻击力提升4%/5%/6%/7%/8%。该效果至多可叠加5层，每0.3秒只能触发一次。此外，处于护盾庇护下时，该效果的攻击力提升效果提高100%。
四风原典.png	四风原典	法器	5星.png	祈愿	46	暴击率
7.2%	608	暴击率
33.1%	无边际的眷顾：移动速度提高10%；在场上每4秒获得8%/10%/12%/14%/16%元素伤害加成。该效果最多叠加4层，角色倒下或离场后清空。
天空之卷.png	天空之卷	法器	5星.png	祈愿	48	攻击力%
7.2%	674	攻击力%
33.1%	浮游四方的灵云：元素伤害加成提升12%/15%/18%/21%/24%；普通攻击命中时，有50%的概率获得高天流云的青睐，在15秒内主动攻击附近的敌人，造成等同于160%/200%/240%/280%/320%攻击力的伤害。该效果每30秒只能触发一次。（注：“高天流云的青睐”是一个自动攻击周围敌人的小球，锁面板，总共攻击6次，不随角色离场消失。队伍中多位角色的“高天流云的青睐”可叠加。）
纯水流华.png	纯水流华	法器	4星.png	锻造	44	攻击力%
6%	565	攻击力%
27.6%	未完的杰作：施放元素战技时，所有元素伤害加成提升8%/10%/12%/14%/16%，持续15秒，并赋予生命值上限24%的生命之契，该效果每10秒至多触发一次。生命之契清除时，每清除1000点将会提供2%/2.5%/3%/3.5%/4%所有元素伤害加成，至多通过这种方式获得12%/15%/18%/21%/24%所有元素伤害加成，持续15秒。
遗祀玉珑.png	遗祀玉珑	法器	4星.png	纪行	41	暴击率
8.0%	454	暴击率
36.8%	碧玉流转：处于队伍后台超过5秒后，生命值上限提升32%/40%/48%/56%/64%，元素精通提升40/50/60/70/80点。装备者登场并留在场上10秒后，该效果将失效。
流浪的晚星.png	流浪的晚星	法器	4星.png	限定祈愿	42	元素精通
36	510	元素精通
165	林野晚星：每10秒，产生如下效果：基于装备者的元素精通的24%/30%/36%/42%/48%，提升该角色的攻击力，并基于该提升的30%为队伍中附近的其他角色提升攻击力，持续12秒，多件同名武器产生的此效果可以叠加。角色处于队伍后台时也能触发效果。
盈满之实.png	盈满之实	法器	4星.png	锻造	42	元素充能效率
10%	510	元素充能效率
45.9%	圆满之相：触发元素反应后，获得「盈缺」效果：元素精通提升24/27/30/33/36点，攻击力降低5%。每0.3秒至多获得一层盈缺效果，至多叠加5层。未触发元素反应时将每6秒失去一层。角色处于队伍后台时也能触发效果。
证誓之明瞳.png	证誓之明瞳	法器	4星.png	2.5版本活动「三界路飨祭」活动限定武器, 活动	44	攻击力%
6%	565	攻击力%
27.6%	微光的海渊民：施放元素战技后，元素充能效率提升24%/30%/36%/42%/48%，持续10秒。
白辰之环.png	白辰之环	法器	4星.png	完成「影向祓行」可获得锻造图纸附有记忆的面具, 锻造	44	元素充能效率
6.7%	565	元素充能效率
30.6%	樱之斋宫：装备该武器的角色触发雷元素相关反应后，队伍中附近的与该元素反应相关的元素类型的角色，获得10%/12.5%/15%/17.5%/20%对应元素的元素伤害加成，持续6秒。通过这种方式，角色获得的元素伤害加成无法叠加。
嘟嘟可故事集.png	嘟嘟可故事集	法器	4星.png	1.6版本活动「盛夏！海岛？大冒险！」活动限定武器, 活动	41	攻击力%
12.0%	454	攻击力%
55.1%	嘟嘟！大冒险：普通攻击命中敌人后的6秒内，重击造成的伤害提升16/20/24/28/32%；重击命中敌人后的6秒内，攻击力提升8/10/12/14/16%。
暗巷的酒与诗.png	暗巷的酒与诗	法器	4星.png	限定祈愿	44	元素充能效率
6.7%	565	元素充能效率
30.6%	变化万端：普通攻击命中敌人后，冲刺或替代冲刺的能力消耗的体力降低14%/16%/18%/20%/22%，持续5秒。此外，使用冲刺或替代冲刺的能力后，攻击力提升20%/25%/30%/35%/40%，持续5秒。
忍冬之果.png	忍冬之果	法器	4星.png	锻造	42	攻击力%
9.0%	510	攻击力%
41.3%	霜葬：普通攻击与重击命中敌人时，有60%/70%/80%/90/100%概率在敌人上方生成恒冰晶核并坠落，造成80%/95%/110%/125%/140%攻击力的范围伤害。若敌人处于冰元素影响下，则造成200%/240%/280%/320%/360%攻击力的伤害。该效果每10秒至多触发一次。
昭心.png	昭心	法器	4星.png	祈愿	41	攻击力%
12.0%	454	攻击力%
55.1%	回响：普通攻击与重击命中时，有50%几率发射一枚昭心法球，造成240%/270%/300%/330%/360%攻击力伤害，至多在敌人之间弹射4次。该效果每12/11/10/9/8秒至多触发一次。
万国诸海图谱.png	万国诸海图谱	法器	4星.png	「星之归还」第二期, 锻造	44	元素精通
24	565	元素精通
110	注能之卷：触发元素反应后的10秒内，获得8%/10%/12%/14%/16%元素伤害加成，该效果最多可叠加2层。
宗室秘法录.png	宗室秘法录	法器	4星.png	商城兑换	44	攻击力%
6.0%	565	攻击力%
27.6%	专注：攻击造成伤害时，暴击率提升8%/10%/12%/14%/16%，最多堆叠5次。攻击造成暴击后，移除已有的专注效果。
流浪乐章.png	流浪乐章	法器	4星.png	祈愿	42	暴击伤害
12.0%	510	暴击伤害
55.1%	登场乐：角色登场时，随机获得一个主题曲，持续10秒。每30秒只能触发一次。宣叙调：攻击力提升60%/75%/90%/105%/120%；咏叹调：全元素伤害提升48%/60％/72%/84%/96%；间奏曲：元素精通提升240/300/360/420/480。
匣里日月.png	匣里日月	法器	4星.png	纪行	42	暴击率
6.0%	510	暴击率
27.6%	日月辉：普通攻击命中后的6秒内，元素战技与元素爆发的伤害提高20%/25%/30%/35%/40%；元素战技与元素爆发命中后的6秒内，普通攻击的伤害提高20%/25%/30%/35%/40%。
西风秘典.png	西风秘典	法器	4星.png	祈愿	42	元素充能效率
10.0%	510	元素充能效率
45.9%	顺风而行：攻击造成暴击时，有60％/70％/80％/90％/100％的几率产生少量元素微粒，能为角色恢复6点元素能量。该效果每12/10.5/9/7.5/6秒只能触发一次。
试作金珀.png	试作金珀	法器	4星.png	锻造	42	生命值
9.0%	510	生命值
41.3%	炊金：施放元素爆发后6秒内，每2秒恢复4/4.5/5/5.5/6点元素能量，队伍中的所有角色每2秒恢复4%/4.5%/5%/5.5%/6%生命值。
祭礼残章.png	祭礼残章	法器	4星.png	祈愿	41	元素精通
48	454	元素精通
221	气定神闲：元素战技造成伤害时，有40%/50%/60%/70%/80%的概率重置该技能的冷却时间，该效果每30/26/22/19/16秒只能触发1次。
黑岩绯玉.png	黑岩绯玉	法器	4星.png	商城兑换	42	暴击伤害
12.0%	510	暴击伤害
55.1%	乘胜追击：击败敌人后，攻击力提升12%/15%/18%/21%/24%，持续30秒。该效果至多叠加3层，每层持续时间独立。
异世界行记.png	异世界行记	法器	3星.png	宝箱, （蒙德区域宝箱）	39	元素充能效率
8.5%	401	元素充能效率
39.0%	能量沐浴：获得元素微粒或元素晶球时，恢复1%/1.25%/1.5%/1.75%/2%生命值。
翡玉法球.png	翡玉法球	法器	3星.png	祈愿	40	元素精通
20	448	元素精通
94	激流：触发蒸发、绽放、感电、冰冻、或水元素扩散反应后的12秒内，攻击力提高20%/25%/30%/35%/40%。
甲级宝珏.png	甲级宝珏	法器	3星.png	宝箱, （璃月区域宝箱）	40	暴击率
3.4%	448	暴击率
15.6%	奔袭战术：击败敌人后的15秒内，移动速度和攻击力提升12%/14%/16%/18%/20%。
魔导绪论.png	魔导绪论	法器	3星.png	祈愿	38	元素精通
41	354	元素精通
187	止水息雷：对处于水元素或雷元素影响下的敌人，造成的伤害提高12%/15%/18%/21%/24%。
讨龙英杰谭.png	讨龙英杰谭	法器	3星.png	祈愿	39	生命值
7.7%	401	生命值
35.2%	传承：主动切换角色时，新登场的角色攻击力提升24%/30%/36%/42%/48%，持续10秒。该效果每20秒只能触发一次。
口袋魔导书.png	口袋魔导书	法器	2星.png	商店购买, 宝箱	33	无	243	无	无
学徒笔记.png	学徒笔记	法器	1星.png	初始武器赠送, 商店购买, 宝箱	23	无	185	无	无
赤沙之杖.png	赤沙之杖	长柄武器	5星.png	限定祈愿	44	暴击率
9.6%	542	暴击率
44.1%	蜃气尽头的热梦：基于装备者元素精通的52%/65%/78%/91%/104%，获得攻击力加成。元素战技命中敌人时，将产生持续10秒的「赤沙之梦」效果：基于装备者元素精通的28%/35%/42%/49%/56%，获得攻击力加成，该效果至多叠加3层。
息灾.png	息灾	长柄武器	5星.png	限定祈愿	49	攻击力%
3.6%	741	攻击力%
16.5%	灭却之戒法：获得12%/15%/18%/21%/24%所有元素伤害加成；施放元素战技后，获得持续20秒的「圆顿」，攻击力每1秒提升3.2%/4.0%/4.8%/5.6%/6.4%，该攻击力提升效果至多叠加6次。当装备此武器的角色处于队伍后台时，「圆顿」的攻击力提升效果翻倍。
薙草之稻光.png	薙草之稻光	长柄武器	5星.png	限定祈愿	46	元素充能效率
12.0%	608	元素充能效率
55.1%	非时之梦·常世灶食：攻击力获得提升，提升程度相当于元素充能效率超出100%部分的28%/35%/42%/49%/56%，至多通过这种方式提升80%/90%/100%/110%/120%。施放元素爆发后的12秒内，元素充能效率提升30%/35%/40%/45%/50%。
注：是基于元素充能效率来获得一个百分比攻击力加成。
护摩之杖.png	护摩之杖	长柄武器	5星.png	限定祈愿	46	暴击伤害
14.4%	608	暴击伤害
66.2%	无羁的朱赤之蝶：生命值提升20%/25%/30%/35%/40%。此外，提供基于装备该武器的角色生命值上限的0.8%/1%/1.2%/1.4%/1.6%，获得攻击力加成。当装备该武器的角色生命值低于50%时，进一步获得1%/1.2%/1.4%/1.6%/1.8%最大生命值上限的攻击力提升。
贯虹之槊.png	贯虹之槊	长柄武器	5星.png	限定祈愿	46	攻击力%
10.8%	608	攻击力%
49.6%	金璋皇极：护盾强效提升20%/25%/30%/35%/40%。攻击命中后的8秒内，攻击力提升4%/5%/6%/7%/8%。该效果至多可叠加5层，每0.3秒只能触发一次。此外，处于护盾庇护下时，该效果的攻击力提升效果提高100%。
（注：需要角色在场触发，角色离场效果不提前结束，有护盾时的加成数值在后台不会退化为无护盾时的。）
和璞鸢.png	和璞鸢	长柄武器	5星.png	祈愿	48	暴击率
4.8%	674	暴击率
22.1%	昭理的鸢之枪：命中敌人时自身攻击力提高3.2%/3.9%/4.6%/5.3%/6%，持续6秒，最高可以叠加7层。该效果每0.3秒最多触发一次。满层状态时伤害提升12%/15%/18%/21%/24%。
天空之脊.png	天空之脊	长柄武器	5星.png	祈愿	48	元素充能效率
8.0%	674	元素充能效率
36.8%	斫断黑翼的利齿：暴击率提升8%/10%/12%/14%/16%， 普通攻击速度提升12%, 此外，普通攻击与重击命中敌人时，有50%概率触发真空刃，在小范围内造成额外40%/55%/70%/85%/100%攻击力的伤害。该效果每2秒至多触发一次。
峡湾长歌.png	峡湾长歌	长柄武器	4星.png	纪行	42	暴击率
6.0%	510	暴击率
27.6%	冰原的诸多故事：队伍中存在至少三种不同元素类型的角色时，元素精通提升120/150/180/210/240点。
公义的酬报.png	公义的酬报	长柄武器	4星.png	锻造	44	生命值
6.0%	565	生命值
27.6%	枪尖一点：受到治疗时，恢复8/10/12/14/16点能量，该效果每10秒至多触发一次，角色处于队伍后台时也能触发。
风信之锋.png	风信之锋	长柄武器	4星.png	3.1版本活动「杯中遥吟之歌」活动限定武器, 活动	42	攻击力%
9.0%	510	攻击力%
41.3%	不至之风：触发元素反应后的10秒内，攻击力提升12%/15%/18%/21%/24%，元素精通提升48/60/72/84/96点。
贯月矢.png	贯月矢	长柄武器	4星.png	锻造	44	元素精通
24	565	元素精通
110	幽林月影：触发燃烧、原激化、超激化、蔓激化、绽放、超绽放或烈绽放后，将在角色周围产生至多存在10秒的「苏生之叶」。拾取苏生之叶的角色攻击力提升16%/20%/24%/28%/32%，持续12秒。每20秒至多通过这种方式产生一枚苏生之叶。角色处于队伍后台时也能触发。
断浪长鳍.png	断浪长鳍	长柄武器	4星.png	限定祈愿	45	攻击力%
3.0%	620	攻击力%
13.8%	驭浪的海祇民：队伍中所有角色的元素能量上限的总和，每1点能使装备此武器的角色的元素爆发造成的伤害提高0.12%/0.15%/0.18%/0.21%/0.24%，通过这种方式，元素爆发造成的伤害至多提高40%/50%/60%/70%/80%。
「渔获」.png	「渔获」	长柄武器	4星.png	NPC商店, 稻妻钓鱼协会兑换	42	元素充能效率
10%	510	元素充能效率
45.9%	船歌：元素爆发造成的伤害提升16%/20%/24%/28%/32%，元素爆发的暴击率提升6%/7.5%/9%/10.5%/12%。
喜多院十文字.png	喜多院十文字	长柄武器	4星.png	完成远吕羽氏遗事可获得锻造图纸。, 锻造	44	元素精通
24	565	元素精通
110	名士振舞：元素战技造成的伤害提升6%/7.5%/9%/10.5%/12%。元素战技命中后，角色流失3点元素能量，并在此后的6秒内，每2秒恢复3/3.5/4/4.5/5点元素能量。该效果每10秒至多触发一次，角色处于队伍后台也能触发。(武器特效与追忆之注连四件套的触发机制不同。元素战技命中后无论有没有能量可供扣除，都能触发后续回能。)
千岩长枪.png	千岩长枪	长柄武器	4星.png	限定祈愿	44	攻击力%
6.0%	565	攻击力%
27.6%	千岩诀·同心：队伍中每有一位璃月角色，装备该武器的角色便获得7%/8%/9%/10%/11%攻击力提升与3%/4%/5%/6%/7%暴击率提升。至多获得4层提升效果。
龙脊长枪.png	龙脊长枪	长柄武器	4星.png	任务, 锻造	41	物理伤害加成
15.0%	454	物理伤害加成
69.0%	霜葬：普通攻击与重击命中敌人时，有60%/70%/80%/90%/100%概率在敌人上方生成恒冰晶核并坠落，造成80%/95%/110%/125%/140%攻击力的范围伤害。若敌人处于冰元素影响下，则造成200%/240%/280%/320%/360%攻击力的伤害。该效果每10秒至多触发一次。
流月针.png	流月针	长柄武器	4星.png	锻造	44	物理伤害加成
7.5%	565	物理伤害加成
34.5%	注能之针：获得元素微粒或元素晶球后的5秒内，普通攻击和重击额外造成20%/25%/30%/35%/40%攻击力伤害。
匣里灭辰.png	匣里灭辰	长柄武器	4星.png	祈愿	41	元素精通
48	454	元素精通
221	踏火止水：对于处于水元素或火元素影响下的敌人，造成的伤害提高20%/24%/28%/32%/36%。
试作星镰.png	试作星镰	长柄武器	4星.png	锻造	42	元素充能效率
10.0%	510	元素充能效率
45.9%	嗜魔：施放元素战技后，普通攻击和重击造成的伤害提高8%/10%/12%/14%/16%。该效果持续12秒，最多叠加2层。
西风长枪.png	西风长枪	长柄武器	4星.png	祈愿	44	元素充能效率
6.7%	565	元素充能效率
30.6%	顺风而行：攻击造成暴击时，有60%/70%/80%/90%/100%的几率产生少量元素微粒，能为角色恢复6点元素能量。该效果每12/10.5/9/7.5/6秒只能触发一次。
黑岩刺枪.png	黑岩刺枪	长柄武器	4星.png	商城兑换	42	暴击伤害
12.0%	510	暴击伤害
55.1%	乘胜追击：击败敌人后，攻击力提升12%/15%/18%/21%/24%，持续30秒。该效果至多叠加3层，每层持续时间独立。
决斗之枪.png	决斗之枪	长柄武器	4星.png	纪行	41	暴击率
8.0%	454	暴击率
36.8%	角斗士：身边至少有2个敌人时，获得16%/20%/24%/28%/32%攻击力提升与16%/20%/24%/28%/32%防御力提升；身边的敌人少于2个时，获得24%/30%/36%/42%/48%攻击力提升。（注：身边没有敌人时算后一个效果）
宗室猎枪.png	宗室猎枪	长柄武器	4星.png	商城兑换	44	攻击力%
6.0%	565	攻击力%
27.6%	专注：攻击造成伤害时，暴击率提升8%/10%/12%/14%/16%,最多堆叠5次。攻击造成暴击后，移除已有的专注效果。
黑缨枪.png	黑缨枪	长柄武器	3星.png	与NPC乌尔班(位于雪山营地)对话获得, 祈愿	38	生命值
10.2%	354	生命值
46.9%	克柔：对史莱姆类敌人造成的伤害增加40%/50%/60%/70%/80%。
钺矛.png	钺矛	长柄武器	3星.png	宝箱	40	攻击力%
5.1%	448	攻击力%
23.5%	沉重：对普通攻击命中的敌人造成160%/200%/240%/280%/320%攻击力的额外伤害。该效果每10秒只能触发一次。
白缨枪.png	白缨枪	长柄武器	3星.png	宝箱, （璃月区域宝箱）	39	暴击率
5.1%	401	暴击率
23.4%	锐利：普通攻击造成的伤害提升24%/30%/36%/42%/48%。
铁尖枪.png	铁尖枪	长柄武器	2星.png	商店购买, 宝箱	33	无	243	无	无
新手长枪.png	新手长枪	长柄武器	1星.png	初始武器赠送, 商店购买, 宝箱	23	无	185	无	无
"""


artifact = """
冒险家生之花.png	冒险家	1	3	宝箱；打怪掉落；仲夏庭园：祝圣秘境：净化之炎	生命值上限提升1000点。	开启各类宝箱后5秒内，持续恢复30%生命值。	生命值
恢复生命值
幸运儿生之花.png	幸运儿	1	3	宝箱；打怪掉落；孤云凌霄之处：祝圣秘境：惊蛰的霜雷	防御力提高100点。	拾取摩拉时，恢复300点生命值。	防御力
恢复生命值
游医生之花.png	游医	1	3	铭记之谷：祝圣秘境：钢铁之舞	角色受到的治疗效果提高20%。	施放元素爆发时，恢复20%生命值。	恢复生命值
受治疗效果
学士生之花.png	学士	2	4	华池岩岫：祝圣秘境：岩牢	元素充能效率提高20%。	获得元素微粒或元素晶球时，队伍中所有弓箭和法器角色额外恢复3点元素能量。该效果每3秒只能触发一次。	元素充能
元素充能效率
战狂生之花.png	战狂	2	4	宝箱；怪物掉落	暴击率提高12%。	生命值低于70%时，暴击率额外提高24%。	暴击率
流放者生之花.png	流放者	3	4	宝箱；击杀精英级怪物,BOSS级怪物	元素充能效率提高20%	施放元素爆发后，每2秒为队伍中所有角色（不包括自己）恢复2点元素能量。该效果持续6秒，无法叠加。	元素充能
元素充能效率
行者之心生之花.png	行者之心	3	4	宝箱；仲夏庭园：祝圣秘境：净化之炎
椛染之庭：祝圣秘境：椛狩	攻击力提高18%。	重击的暴击率提高30%。	攻击力
暴击率
祭冰之人生之花.png	祭冰之人	3	4	急冻树、无相之冰、古岩龙蜥、兆载永劫龙兽掉落	（套装仅一件）受到的冰元素附着效果的持续时间减少40%	无	元素附着效果减轻
奇迹生之花.png	奇迹	3	4	铭记之谷：祝圣秘境：钢铁之舞
椛染之庭：祝圣秘境：椛狩	所有元素抗性提高20%。	受到某个元素类型的伤害后，相应的抗性提升30%，持续10秒。该效果每10秒只能触发一次。	元素抗性
勇士之心生之花.png	勇士之心	3	4	孤云凌霄之处：祝圣秘境：惊蛰
山脊守望：祝圣秘境：不移
沉眠之庭：祝圣秘境：骸馆	攻击力提高18%。	对生命值高于50%的敌人，造成的伤害增加30%。	攻击力
伤害
教官生之花.png	教官	3	4	宝箱；打怪掉落	元素精通提高80点。	触发元素反应后。队伍中所有角色元素精通提高120点，持续8秒。	元素精通
祭火之人生之花.png	祭火之人	3	4	爆炎树、无相之火、古岩龙蜥掉落	（套装仅一件）受到的火元素附着效果的持续时间减少40%	无	元素附着效果减轻
赌徒生之花.png	赌徒	3	4	华池岩岫：祝圣秘境：岩牢Ⅰ至Ⅲ
芬德尼尔之顶：祝圣秘境：告死之霜Ⅰ至Ⅳ＜br＞岩中幽谷：祝圣秘境：机巢Ⅰ至Ⅳ	元素战技造成的伤害提升20%	击败敌人时，有100%概率清除元素战技的冷却时间。该效果每15秒至多触发一次。	元素战技伤害
减少元素战技CD
祭水之人生之花.png	祭水之人	3	4	纯水精灵、无相之水、古岩龙蜥掉落	（套装仅一件）受到的水元素附着效果的持续时间减少40%	无	元素附着效果减轻
武人生之花.png	武人	3	4	无妄引咎密宫：祝圣秘境：寒霜
山脊守望：祝圣秘境：不移	普通攻击与重击造成的伤害提高15%。	施放元素战技后的8秒内，普通攻击和重击造成的伤害提升25%。	普攻伤害
重击伤害
守护之心生之花.png	守护之心	3	4	无妄引咎密宫：祝圣秘境：寒霜
芬德尼尔之顶：祝圣秘境：告死之霜Ⅰ至Ⅳ
沉眠之庭：祝圣秘境：骸馆Ⅰ至Ⅳ	防御力提高30%。	队伍里每有不同一种元素类型的自己的角色，自身获得30%相应的元素抗性。	防御力
元素抗性
祭雷之人生之花.png	祭雷之人	3	4	无相之雷、雷音权现、掣电树、古岩龙蜥掉落	（套装仅一件）受到的雷元素附着效果的持续时间减少40%	无	元素附着效果减轻
流浪大地的乐团生之花.png	流浪大地的乐团	4	5	BOSS（首领、周本）、深境螺旋	元素精通提高80点。	装备该圣遗物套装的角色为法器、弓箭角色时，角色重击造成的伤害提高35%。	元素精通
重击伤害
逆飞的流星生之花.png	逆飞的流星	4	5	孤云凌霄之处：祝圣秘境：惊蛰Ⅲ以上	护盾强效提高35%。	处于护盾庇护下时，额外获得40%普通攻击和重击伤害加成。	护盾强效
普攻伤害
重击伤害
护盾庇护
乐园遗落之花生之花.png	乐园遗落之花	4	5	赤金的城墟：祝圣秘境：沙中孤城Ⅲ以上	元素精通提高80点 。	装备者绽放、超绽放、烈绽放反应造成的伤害提升40%。此外，装备者触发绽放、超绽放、烈绽放后，上述效果带来的加成提升25%。效果持续10秒，至多叠加4次，每1秒至多触发一次。装备者处于队伍后台时依然能触发该效果。	元素精通
伤害
后台触发
平息鸣雷的尊者生之花.png	平息鸣雷的尊者	4	5	仲夏庭园：祝圣秘境：净化之炎Ⅲ以上	雷元素抗性提高40%。	对处于雷元素影响下的敌人造成的伤害提升35%。	元素抗性
伤害
雷
辰砂往生录生之花.png	辰砂往生录	4	5	岩中幽谷：祝圣秘境：机巢 Ⅰ以上、深境螺旋	攻击力提高18%。	施放元素爆发后，将产生持续16秒的「潜光」效果：攻击力提升8%；并在角色的生命值降低时，攻击力进一步提升10%，至多通过这种方式提升4次，每0.8秒至多触发一次。「潜光」效果将在角色退场时消失；持续期间再次施放元素爆发，将移除原有的「潜光」。	攻击力
渡过烈火的贤人生之花.png	渡过烈火的贤人	4	5	无妄引咎密宫：祝圣秘境：寒霜Ⅰ以上	火元素抗性提高40%。	对处于火元素影响下的敌人造成的伤害提升35%。	元素抗性
伤害
火
千岩牢固生之花.png	千岩牢固	4	5	山脊守望：祝圣秘境：不移I以上	生命值提升20%。	元素战技命中敌人后，使队伍中附近的所有角色攻击力提升20%，护盾强效提升30%，持续3秒。该效果每0.5秒至多触发一次。装备此圣遗物套装效果的角色处于队伍后台时，依然能触发该效果。	生命值
攻击力
护盾强效
后台触发
被怜爱的少女生之花.png	被怜爱的少女	4	5	铭记之谷：祝圣秘境：钢铁之舞Ⅱ以上	角色造成的治疗效果提升15%。	施放元素战技或元素爆发后的10秒内，队伍中所有角色受治疗效果加成提高20%。	治疗效果
受治疗效果
水仙之梦生之花.png	水仙之梦	4	5	熔铁的孤塞：祝圣秘境：遗世边垒I以上	获得15%水元素伤害加成。	普通攻击、重击、下落攻击、元素战技或元素爆发命中敌人后，将产生1层持续8秒的「镜中水仙」效果。处于1/2/3层及以上「镜中水仙」效果下时，攻击力将提高7%/16%/25%，水元素伤害加成提升4%/9%/15%。由普通攻击、重击、下落攻击、元素战技或元素爆发产生的「镜中水仙」将分别独立存在。	水
元素伤害
攻击力
来歆余响生之花.png	来歆余响	4	5	岩中幽谷：祝圣秘境：机巢Ⅰ以上、深境螺旋	攻击力提高18%。	普通攻击命中敌人时，有36%概率触发「幽谷祝祀」：普通攻击造成的伤害提高，伤害提高值为攻击力的70%，该效果将在普通攻击造成伤害后的0.05秒后清除。普通攻击未触发「幽谷祝祀」时，会使下次触发概率提升20%；0.2秒内至多判定1次触发与否。	攻击力
普攻伤害
炽烈的炎之魔女生之花.png	炽烈的炎之魔女	4	5	无妄引咎密宫：祝圣秘境：寒霜Ⅰ以上	获得15%火元素伤害加成。	超载、燃烧、烈绽放反应造成的伤害提升40%，蒸发、融化反应的加成系数提高15%。施放元素战技后的10秒内，二件套的效果提高50%，该效果最多叠加3次。	元素伤害
火
绝缘之旗印生之花.png	绝缘之旗印	4	5	椛染之庭：祝圣秘境：椛狩Ⅰ以上	元素充能效率提高20%。	基于元素充能效率的25%，提高元素爆发造成的伤害。至多通过这种方式获得75%提升。	元素充能效率
元素爆发伤害
角斗士的终幕礼生之花.png	角斗士的终幕礼	4	5	击杀精英级怪物,BOSS级怪物，通关周常boss，深境螺旋。	攻击力提高18%。	装备该圣遗物套装的角色为单手剑、双手剑、长柄武器角色时，角色普通攻击造成的伤害提高35%。	攻击力
普攻伤害
花海甘露之光生之花.png	花海甘露之光	4	5	熔铁的孤塞：祝圣秘境：遗世边垒I以上	生命值提升20%。	元素战技与元素爆发造成的伤害提升10%；装备者受到伤害后的5秒内，上述伤害提升效果提高80%，该提高效果至多叠加5层，每层持续时间独立计算，处于队伍后台时依然能触发该效果。	生命值
元素战技伤害
元素爆发伤害
后台触发
深林的记忆生之花.png	深林的记忆	4	5	缘觉塔：祝圣秘境：七识Ⅰ以上	获得15%草元素伤害加成。	元素战技或元素爆发命中敌人后，使命中目标的草元素抗性降低30%，持续8秒。装备者处于队伍后台时，依然能触发该效果。	元素伤害
草
减抗
后台触发
如雷的盛怒生之花.png	如雷的盛怒	4	5	仲夏庭园：祝圣秘境：净化之炎Ⅲ以上	获得15%雷元素伤害加成。	超载、感电、超导、超绽放反应造成的伤害提升40%，超激化反应带来的伤害提升提高20%。触发上述元素反应或原激化反应时，元素战技冷却时间减少1秒。该效果每0.8秒最多触发一次。	元素伤害
雷
减少元素战技CD
追忆之注连生之花.png	追忆之注连	4	5	椛染之庭：祝圣秘境：椛狩Ⅰ以上	攻击力提高18%。	施放元素战技时，如果角色的元素能量高于或等于15点，则会流失15点元素能量，使接下来的10秒内，普通攻击、重击、下落攻击造成的伤害提高50%。持续期间内效果不会再次触发。	攻击力
伤害
重击伤害
普攻伤害
下落攻击伤害
冰风迷途的勇士生之花.png	冰风迷途的勇士	4	5	芬德尼尔之顶：祝圣秘境：告死之霜Ⅰ以上	获得15%冰元素伤害加成。	攻击处于冰元素影响下的敌人时，暴击率提高20%；若敌人处于冻结状态下，则暴击率额外提高20%。	冰
暴击率
元素伤害
黄金剧团生之花.png	黄金剧团	4	5	罪祸的终末：祝圣秘境：谐律 I以上	元素战技造成的伤害提升20%。	元素战技造成的伤害提升25%；此外，处于队伍后台时，元素战技造成的伤害还将进一步提升25%，该效果将在登场后2秒移除。	元素战技伤害
染血的骑士道生之花.png	染血的骑士道	4	5	华池岩岫：祝圣秘境：岩牢Ⅰ以上	造成的物理伤害提高25%。	击败敌人后的10秒内，施放重击时不消耗体力，且重击造成的伤害提升50%	物理伤害
重击伤害
饰金之梦生之花.png	饰金之梦	4	5	缘觉塔：祝圣秘境：七识Ⅰ以上	元素精通提高80点。	触发元素反应后的8秒内，会根据队伍内其他角色的元素类型，使装备者获得强化：队伍中每存在1个和装备者同类元素的角色，攻击力提升14%;每存在1个和装备者不同元素类型的角色，元素精通提升50点。上述每类效果至多计算3个角色。该效果每8秒至多触发一次。装备者处于队伍后台时，依然能触发该效果。	元素精通
攻击力
后台触发
华馆梦醒形骸记生之花.png	华馆梦醒形骸记	4	5	沉眠之庭：祝圣秘境：骸馆Ⅰ以上	防御力提高30%。	装备此圣遗物套装的角色在以下情况下，将获得「问答」效果：在场上用岩元素攻击命中敌人后获得一层，每0.3秒至多触发一次；在队伍后台中，每3秒获得一层。问答至多叠加4层，每层能提供6%防御力与6%岩元素伤害加成。每6秒，若未获得问答效果，将损失一层。	防御力
后台触发
岩
元素伤害
昔日宗室之仪生之花.png	昔日宗室之仪	4	5	华池岩岫：祝圣秘境：岩牢Ⅰ以上	元素爆发造成的伤害提升20％ 。	施放元素爆发后，队伍中所有角色攻击力提升20％，持续12秒。该效果不可叠加。	攻击力
元素爆发伤害
沉沦之心生之花.png	沉沦之心	4	5	芬德尼尔之顶：祝圣秘境：告死之霜Ⅰ以上	获得15%水元素伤害加成。	施放元素战技后的15秒内，普通攻击与重击造成的伤害提高30%。	水
元素伤害
普攻伤害
重击伤害
逐影猎人生之花.png	逐影猎人	4	5	罪祸的终末：祝圣秘境：谐律 I以上	普通攻击与重击造成的伤害提高15%。	当前生命值提升或降低时，暴击率提升12%，该效果持续5秒，至多叠加3次。	普攻伤害
重击伤害
暴击率
悠古的磐岩生之花.png	悠古的磐岩	4	5	孤云凌霄之处：祝圣秘境：惊蛰Ⅲ以上	获得15%岩元素伤害加成。	获得结晶反应形成的晶片时，队伍中所有角色获得35%对应元素伤害加成，持续10秒。同时只能通过该效果获得一种元素伤害加成。	岩
元素伤害
沙上楼阁史话生之花.png	沙上楼阁史话	4	5	赤金的城墟：祝圣秘境：沙中孤城I以上	获得15%风元素伤害加成。	重击命中敌人后，该角色的普通攻击速度提升10%，普通攻击、重击与下落攻击造成的伤害提升40%，持续15秒。	风
元素伤害
普攻伤害
重击伤害
下落攻击伤害
攻击速度
海染砗磲生之花.png	海染砗磲	4	5	沉眠之庭：祝圣秘境：骸馆Ⅰ以上	治疗加成提高15%。	装备此圣遗物套装的角色对队伍中的角色进行治疗时，将产生持续3秒的海染泡沫，记录治疗的生命值回复量（包括溢出值）。持续时间结束时，海染泡沫将会爆炸，对周围的敌人造成90%累计回复量的伤害（该伤害结算方式同感电、超导等元素反应，但不受元素精通、等级或反应伤害加成效果影响）。每3.5秒至多产生一个海染泡沫；海染泡沫至多记录30000点回复量，含溢出部分的治疗量；自己的队伍中同时至多存在一个海染泡沫。装备此圣遗物套装的角色处于队伍后台时，依然能触发该效果。	治疗效果
后台触发
翠绿之影生之花.png	翠绿之影	4	5	铭记之谷：祝圣秘境：钢铁之舞Ⅱ以上	获得15%风元素伤害加成。	扩散反应造成的伤害提升60%，根据扩散的元素类型，降低受到影响的敌人40%的对应元素抗性，持续10秒。	风
元素伤害
减抗
苍白之火生之花.png	苍白之火	4	5	山脊守望：祝圣秘境：不移I以上	造成的物理伤害提高25%。	元素战技命中敌人后，攻击力提升9%。该效果持续7秒，至多叠加2层，每0.3秒至多触发一次。叠满2层时，2件套的效果提升100%。	物理伤害
攻击力
"""

# character="旅行者"
# weapon="无锋刃"
# artifact="绝缘套装"